#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
github_team.teams["infrastructure"]: Refreshing state... [id=6847100]
github_team.teams["distribution"]: Refreshing state... [id=6847101]
github_team.teams["async-events"]: Refreshing state... [id=7998296]
github_team.teams["content"]: Refreshing state... [id=6847102]
github_team.teams["tech-lead"]: Refreshing state... [id=6847098]
github_repository.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=mirror-magento-cloud-patches]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=mirror-magento2-functional-testing-framework]
github_team.teams["continuous-integration"]: Refreshing state... [id=6847099]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=mirror-commerce-admin.en]
github_repository.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=mirror-magento-coding-standard]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-quality-patches"]: Refreshing state... [id=mirror-quality-patches]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=mirror-commerce-operations.en]
github_repository.repositories["mageos-composer"]: Refreshing state... [id=mageos-composer]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["meta"]: Refreshing state... [id=meta]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["github-actions"]: Refreshing state... [id=github-actions]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_repository.repositories["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_membership.users["wigman"]: Refreshing state... [id=Mage-OS:wigman]
github_membership.users["damienwebdev"]: Refreshing state... [id=Mage-OS:damienwebdev]
github_membership.users["mage-os-ci"]: Refreshing state... [id=Mage-OS:mage-os-ci]
github_membership.users["johnhughes1984"]: Refreshing state... [id=Mage-OS:johnhughes1984]
github_membership.users["Vinai"]: Refreshing state... [id=Mage-OS:Vinai]
github_membership.users["DavidLambauer"]: Refreshing state... [id=Mage-OS:DavidLambauer]
github_membership.users["gowrizrh"]: Refreshing state... [id=Mage-OS:gowrizrh]
github_membership.users["sprankhub"]: Refreshing state... [id=Mage-OS:sprankhub]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=6847101:Vinai]
github_team_membership.members["damienwebdev_distribution"]: Refreshing state... [id=6847101:damienwebdev]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=6847100:sprankhub]
github_team_membership.members["gowrizrh_async-events"]: Refreshing state... [id=7998296:gowrizrh]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=6847100:Vinai]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=6847101:sprankhub]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=6847098:Vinai]
github_team_membership.members["wigman_content"]: Refreshing state... [id=6847102:wigman]
github_team_membership.members["DavidLambauer_infrastructure"]: Refreshing state... [id=6847100:DavidLambauer]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=6847102:Vinai]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=6847102:johnhughes1984]
github_team_membership.members["mage-os-ci_continuous-integration"]: Refreshing state... [id=6847099:mage-os-ci]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=6847100:damienwebdev]
github_branch_protection.mirrors["mirror-quality-patches"]: Refreshing state... [id=BPR_kwDOJIrSsM4CGjIE]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOG1y7C84By-d5]
github_branch_protection.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=BPR_kwDOH_yQXM4B1Gm0]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOG8L6gs4By-eB]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOG8FefM4By-dZ]
github_branch_protection.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=BPR_kwDOH_yQpc4B1Gmt]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDOGMKFF84By-dc]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDOGwaLE84By-dS]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOGMKCJ84By-dW]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOG3Ro_84By-dJ]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDOHynKTc4By-d9]
github_branch_protection.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDOJpbVr84CQwEY]
github_branch_protection.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=BPR_kwDOJpbWgc4CQwEW]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDOG8FV-s4By-dL]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOG1y6y84By-df]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDOG3Rr984By-dH]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDOGMKCY84By-d1]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDOIIQUpM4By-eH]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDOGMKBz84By-dN]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDOGHBHCc4By-d4]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDOGMKC6M4By-d2]
github_branch_protection.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=BPR_kwDOJIrSxM4CGjIG]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOGMKAG84By-dP]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOISiVZc4BzuWM]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOISihV84BzuWa]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDOGta9mM4B0QmJ]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOISiZ3M4BzuWZ]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOISimRc4BzuWh]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDOIShpTM4BzuWV]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOISivQc4BzuWP]
github_branch_protection.repositories["github-actions"]: Refreshing state... [id=BPR_kwDOJVdHWc4CK7Rj]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDOISixH84BzuWN]
github_branch_protection.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=BPR_kwDOJpbZ9c4CQwEV]
github_branch_protection.repositories["dev-env-gitpod"]: Refreshing state... [id=BPR_kwDOIfCi6c4B3JNi]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDOIShsYM4BzuWO]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDOHNQe7c4BysLD]
github_branch_protection.repositories["meta"]: Refreshing state... [id=BPR_kwDOJIrS4M4CGjIK]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDOGIl6i84BysLC]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOISiqV84BzuWX]
github_branch_protection.repositories["mageos-composer"]: Refreshing state... [id=BPR_kwDOJpba4M4CQwER]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDOGHBGY84BysK_]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOISiM084BzuWR]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDOH66Nbs4BysK-]
github_branch_protection.repositories["mage-os-website"]: Refreshing state... [id=BPR_kwDOGCTTT84BysLE]
github_branch_protection.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDOJpbY-84CQwEP]
github_branch_protection.repositories["mageos-async-events"]: Refreshing state... [id=BPR_kwDOJIrSz84CGjIQ]
github_repository_file.codeowners["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["github-actions"]: Refreshing state... [id=github-actions/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["mageos-composer"]: Refreshing state... [id=mageos-composer/CODEOWNERS]
github_repository_file.codeowners["meta"]: Refreshing state... [id=meta/CODEOWNERS]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["mage-os-website"]: Refreshing state... [id=mage-os-website/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events"]: Refreshing state... [id=mageos-async-events/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/CODEOWNERS]
github_branch_default.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_team_repository.tech-lead["mageos-magento-coding-standard"]: Refreshing state... [id=6847098:mageos-magento-coding-standard]
github_team_repository.tech-lead["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=6847098:mageos-magento2-functional-testing-framework]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=6847098:terraform]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=6847098:mageos-security-package]
github_team_repository.tech-lead["dev-env-gitpod"]: Refreshing state... [id=6847098:dev-env-gitpod]
github_team_repository.tech-lead["github-actions"]: Refreshing state... [id=6847098:github-actions]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=6847098:namespace]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=6847098:mageos-magento2-page-builder]
github_team_repository.tech-lead["meta"]: Refreshing state... [id=6847098:meta]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=6847098:mageos-commerce-data-export]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=6847098:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["mageos-async-events"]: Refreshing state... [id=6847098:mageos-async-events]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=6847098:mageos-adobe-stock-integration]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=6847098:mageos-magento2-sample-data]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=6847098:mageos-magento2]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=6847098:infrastructure]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=6847098:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=6847098:mageos-composer-dependency-version-audit-plugin]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=6847098:mageos-magento-composer-installer]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=6847098:mage-os-website]
github_team_repository.tech-lead["mageos-composer"]: Refreshing state... [id=6847098:mageos-composer]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=6847098:generate-mirror-repo-js]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=6847098:mageos-inventory]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=6847100:infrastructure]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-inventory-composer-installer]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-magento-composer-installer]
github_team_repository.teams["meta_distribution"]: Refreshing state... [id=6847101:meta]
github_team_repository.teams["dev-env-gitpod_infrastructure"]: Refreshing state... [id=6847100:dev-env-gitpod]
github_team_repository.teams["mageos-composer_distribution"]: Refreshing state... [id=6847101:mageos-composer]
github_team_repository.teams["mageos-magento2-functional-testing-framework_distribution"]: Refreshing state... [id=6847101:mageos-magento2-functional-testing-framework]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=6847101:mageos-magento2]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=6847101:mageos-adobe-stock-integration]
github_team_repository.teams["meta_content"]: Refreshing state... [id=6847102:meta]
github_team_repository.teams["terraform_infrastructure"]: Refreshing state... [id=6847100:terraform]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=6847100:generate-mirror-repo-js]
github_team_repository.teams["mageos-magento-coding-standard_distribution"]: Refreshing state... [id=6847101:mageos-magento-coding-standard]
github_team_repository.teams["github-actions_distribution"]: Refreshing state... [id=6847101:github-actions]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=6847101:mageos-inventory]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=6847101:mageos-security-package]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-root-update-plugin]
github_team_repository.teams["mageos-async-events_async-events"]: Refreshing state... [id=7998296:mageos-async-events]
github_team_repository.teams["mageos-async-events_distribution"]: Refreshing state... [id=6847101:mageos-async-events]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=6847100:namespace]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=6847101:mageos-magento2-page-builder]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=6847101:mageos-commerce-data-export]
github_team_repository.teams["meta_tech-lead"]: Refreshing state... [id=6847098:meta]
github_team_repository.teams["meta_infrastructure"]: Refreshing state... [id=6847100:meta]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=6847102:mage-os-website]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=6847101:mageos-magento2-sample-data]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_membership.users["DavidLambauer"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"8ba1c861d1d2a66d384e97058eeb0bf924a148b043656b5c183739b7f31b3b0a\"" -> "W/\"5890a215326abafdda90e328d40babcbdeff6744960bdcf7dfd9bec86be63ac2\""
        id       = "Mage-OS:DavidLambauer"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["Vinai"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"a0ad5ddfde341fe714126a8c4231e56701e6a5425a13b4d5dd2c1efdde7b6ea1\"" -> "W/\"6f38d6d529f4866c2cd42b28df6848dd9c10f81e53eb7561e89c441331122979\""
        id       = "Mage-OS:Vinai"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["damienwebdev"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"03833890147969af57fe96c0093f54d7203570cbfaee59fa677109c620970630\"" -> "W/\"f97bfa9faf2c11669c2f49134e39461443c16b1abde123b7f5291722f159c23d\""
        id       = "Mage-OS:damienwebdev"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["gowrizrh"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"834e5541ba1e370522c10ed97e4c6d7652a04dde4acd53902f38b035660cdd91\"" -> "W/\"0a1bdade6f9d64c99a64434d6880b8cd645d31c7dbc31b5558d52071f0298814\""
        id       = "Mage-OS:gowrizrh"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["johnhughes1984"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"725e0a08cc775af998fc6a65815319cb2162b1c5614bc82199f5245834c66ac0\"" -> "W/\"93b9be6a912ba50eba1e606191a6044edf30b0617a9439f746533d31112fc2bf\""
        id       = "Mage-OS:johnhughes1984"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["mage-os-ci"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"80e54461c54d6e1497837ba167494eb6d8bc2d2d240d42658c39c8fc38020df4\"" -> "W/\"6fd2befe8afbff510f34f7b49a4919edadc86ba894e7cbd6cc8908042607975f\""
        id       = "Mage-OS:mage-os-ci"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["sprankhub"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"f0a4f5c055a5de04bea1549a8e177278b33b2ed7139c8af26564f72b5284147e\"" -> "W/\"efd496c28f0e583833860dedb0c9a716395d864590496e32fb87556c35c18653\""
        id       = "Mage-OS:sprankhub"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["wigman"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"ce90e92f0dc757d313546c0640b736c9a025babbac0cbe0277a565a3f93e8802\"" -> "W/\"cba9f0675ff47e23a868827a13373aad99eac42fd74f7f45024eb9f361c75c82\""
        id       = "Mage-OS:wigman"
        # (2 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-adobe-ims"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"e03fb00d0bb96609dd3d30d3e3536d01444a2a6f9650091f92c1a89eba42bd00\"" -> "W/\"458091e261c055d723130bd8112f93636404fac1923fc913f1ce12d79ca96be3\""
        id                          = "mirror-adobe-ims"
        name                        = "mirror-adobe-ims"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-adobe-stock-integration"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"19e58e3cd3e51c6e2916563a2eb173eb43bc08afc1f9ce201313a66d7b840ff0\"" -> "W/\"4b9118fd5174156461a0410b5c81e31306e7f3d6990ade096a14d145f7f02198\""
        id                          = "mirror-adobe-stock-integration"
        name                        = "mirror-adobe-stock-integration"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-admin.en"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"24040914a311885e2a0e1be939a224d727073ba3547fb5a6406d86d950cc96f1\"" -> "W/\"8f9777ad51090efc5ac2353a7d048625f50fc665b2586375703bfd56e6b186b7\""
        id                          = "mirror-commerce-admin.en"
        name                        = "mirror-commerce-admin.en"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-data-export"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"879bc7ace866123c41fad9d0ff6ac34618105afee69f9e649ab3103808de8677\"" -> "W/\"61b49b4ccd1865a374857f27d2d9976d5c883fa58655ded38b53194c32eb8b57\""
        id                          = "mirror-commerce-data-export"
        name                        = "mirror-commerce-data-export"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-operations.en"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"34dd7aa1eec24152f58c5d7edf319350cea1512c43e8ab585bc8481fac923c5b\"" -> "W/\"4ddf8351bc8de3b143062dc28b553cf68559d41d39d76c2cda9e8bc4ddf65aec\""
        id                          = "mirror-commerce-operations.en"
        name                        = "mirror-commerce-operations.en"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"00b3dcdc2a9a2dced4fd154b9a0c857b7a6617b6658664503befe77e494ede0f\"" -> "W/\"87aa58fa8e8020ab6be0360eccfb291256ceb8d24d21ede191f1d433a94f52ce\""
        id                          = "mirror-composer"
        name                        = "mirror-composer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"e921358675ab999e9decc331fe8012bf1766b4dd38fcbcb066de198ff5994c67\"" -> "W/\"b26985b95145d50367772449851e729a7cb051acaa341f0d45177cee44d9cce1\""
        id                          = "mirror-composer-dependency-version-audit-plugin"
        name                        = "mirror-composer-dependency-version-audit-plugin"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer-root-update-plugin"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"2959df34cf6170f27283dce81704ad6a799efbc103bd5febc817e0ee98a622d9\"" -> "W/\"739d9851c02503f8313485d9eb0b7bc7f7dee6f15bbe87a672161917997e12e0\""
        id                          = "mirror-composer-root-update-plugin"
        name                        = "mirror-composer-root-update-plugin"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-devdocs"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"6c7572dfcb8f3084a96a9c3f2d6aad87f7584ec3299a32f03cce5b0f22af8854\"" -> "W/\"ca3e1d3b0ce7da3304841c52e57ab5680e027d54ed301043b593eb77c066ae73\""
        id                          = "mirror-devdocs"
        name                        = "mirror-devdocs"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-inventory"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"8de7775c68dbe7cfd15e8308181c6ddd6bd627f50f6d4ca0e0bbedd16554d9c1\"" -> "W/\"bc5d07798f589ad78b9bd77a0b144727398b3b3adc5a56f664b98380aca3c512\""
        id                          = "mirror-inventory"
        name                        = "mirror-inventory"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-inventory-composer-installer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"9d5da51b0061beace0106fae305abb6c59a41d28527c90963ad640b0c55421f3\"" -> "W/\"354ee1ee4d4aff26dfb7ba4b710308fba0824660a4be935b3e0981e7ae8af60c\""
        id                          = "mirror-inventory-composer-installer"
        name                        = "mirror-inventory-composer-installer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-cloud-patches"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"35c77c2fcfb74122a7d866488bbc67c376186990e6d1f5217e5ce6e9f580d161\"" -> "W/\"6078dae8f1f7690e2188bf5047ab27d836c154ab91b7cdffbffb5d77fb8bf864\""
        id                          = "mirror-magento-cloud-patches"
        name                        = "mirror-magento-cloud-patches"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-coding-standard"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"f007c318e5cbf9a0c0250896086dca227d97232972f25124131f57242eedfb11\"" -> "W/\"bacadeef6655c721dd4c7b2234bdbfdb30a8609fd020e117c768342619b46452\""
        id                          = "mirror-magento-coding-standard"
        name                        = "mirror-magento-coding-standard"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-composer-installer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"1baf1ac94d9cad65fd0315ba4805fbf00d1c97cf20b703b5957d9a464125e2e6\"" -> "W/\"e795ca0272e3862beb53ca35f0ca72b0fba40665bfb74989760947460d8ab4a5\""
        id                          = "mirror-magento-composer-installer"
        name                        = "mirror-magento-composer-installer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"72a23be17587255afbf3373410c187bb8df25fa7822fdbe6e1b271bd968647c0\"" -> "W/\"5ec3494827935397bb13a6ca3cb130ad474dd02198a8794f9bb57cf7dd4844e5\""
        id                          = "mirror-magento2"
        name                        = "mirror-magento2"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-functional-testing-framework"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"6c841e05970021e8b9023b7a0c95bbb2cdea711708615101cc7eb904aee76572\"" -> "W/\"9c87ac1416c3a351dd43fe2cd049e80740b252b915a9d2d989dd64c8afed362a\""
        id                          = "mirror-magento2-functional-testing-framework"
        name                        = "mirror-magento2-functional-testing-framework"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-page-builder"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"6231de6cbd732083c4fb738568773f4c0aee7b296cbdedbe3a9ab83be92791ad\"" -> "W/\"408fd4256793e0b0ab794f06a33ae43e418497136628198204bef92deb6b1185\""
        id                          = "mirror-magento2-page-builder"
        name                        = "mirror-magento2-page-builder"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-sample-data"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"a4939628ad046196a9811e214d761b6c186f4f1045391eb3e1971986e9505d48\"" -> "W/\"013db97c45387d9ebeaf0290a2f6e5ec489234c8a9c7e6c3b3cb3b72a7812ef7\""
        id                          = "mirror-magento2-sample-data"
        name                        = "mirror-magento2-sample-data"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-module-configurable-sample-data-venia"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"940fdb086b56ca82a1d08cd881d7a33d16cc7cd238402c48a1d1d9fe1254a230\"" -> "W/\"6e46882ae3dd0cb3ee2e45436b74657da6f620dbe2db468b5f73779e421442b2\""
        id                          = "mirror-module-configurable-sample-data-venia"
        name                        = "mirror-module-configurable-sample-data-venia"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-page-builder-types"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"7429801d0919085ce287fb33b99c72eae1d9f0e893a43d297a6329ca1ca9bd31\"" -> "W/\"a84924299ffd5fd72938d2a5ae9ce69607b41e17399f8f091d5089550775a008\""
        id                          = "mirror-page-builder-types"
        name                        = "mirror-page-builder-types"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-quality-patches"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"5b0745458c9bfb2320c1a3016645172efbac0b40f3d0bcbe3bae0be082ad0b98\"" -> "W/\"6c5200bb88ecda5fa66d1bdfbc5e5804c046b1d5284204d34c4f1356792b324a\""
        id                          = "mirror-quality-patches"
        name                        = "mirror-quality-patches"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-security-package"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"6c652a8e8f0ec0f23ce6928b6505202ff4c6d579f935f6d08c0576fe842b6cf0\"" -> "W/\"6b5bb2a4f0d662d44ca162af1c177f19f32f0afd0a74608e6cdb86e38993606d\""
        id                          = "mirror-security-package"
        name                        = "mirror-security-package"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-zf1"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"fcef15e321e47c600aa45f5c54f13ba05ecd19552c2b83573f85149c65b0bca6\"" -> "W/\"a8d29a528263166e1bc4b655eafa1fa12a96cc418b72732d9436a6084fdb03bf\""
        id                          = "mirror-zf1"
        name                        = "mirror-zf1"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["dev-env-gitpod"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"88df2f7dff85d975c00cc204e804bb96ab5463f5d11f74d049e978792512b1e0\"" -> "W/\"368b72b0d63766b6625d3ca3b91bd6c8e64d2e9799fb42772a967563484072cd\""
        id                          = "dev-env-gitpod"
        name                        = "dev-env-gitpod"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["generate-mirror-repo-js"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"ad94913177fe534e47a0a5a6f4110dc826c9200cf2761c08aaf2002a654494d9\"" -> "W/\"b7cb76a19ec087e20d4ad54b8eb8c0517bc57d4698b139fdb4cc6701e5efcf3c\""
        id                          = "generate-mirror-repo-js"
        name                        = "generate-mirror-repo-js"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["github-actions"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"856fbc9641e02c3474d9d1802ea8ab6a5c090664db9f8b95363da5552954a608\"" -> "W/\"2a61d1f7bc564ea040bed7cbb9ab4058abedfff13736e5e28f2394348baed67a\""
        id                          = "github-actions"
        name                        = "github-actions"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["infrastructure"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"f133e6877b2d14ba05f5a108f6c08375658641be5bfdec39fd345c174edbeb21\"" -> "W/\"7b6a363125b79f5bf2dd9b52085585285e15de8036f1548a810a4b98fc97f4c0\""
        id                          = "infrastructure"
        name                        = "infrastructure"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mage-os-website"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"c703dd60ac8d57a6017826ddde35d56f377f44a5e300086868458a15ca76ed6b\"" -> "W/\"57611369b343568b6c78885694165b1843d06ff08ef5598647bb9eaf2a095996\""
        id                          = "mage-os-website"
        name                        = "mage-os-website"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-adobe-stock-integration"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"912d6c4608b910e3f014e5818e355ba447f9d534f4ec42fedab9fd8197dbcc45\"" -> "W/\"694aae2ab02bf0c99bb13a01a856fed391befed97cc0b74c6949c2c4950c9832\""
        id                          = "mageos-adobe-stock-integration"
        name                        = "mageos-adobe-stock-integration"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-async-events"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"efa15dd3c01bc7992d7d5114b8f8325c63d992d714a7e9c7e71c3560eb7fb761\"" -> "W/\"b38ec98a1e15d57598787e669fd096f4ec29e9790edd5e7f29d158a9ad6208cb\""
        id                          = "mageos-async-events"
        name                        = "mageos-async-events"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-commerce-data-export"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"80df79ffee0520e0b83ebabb36c94a3785a6413887facfa8a998b042dbdab94e\"" -> "W/\"95083a10bbc9e75a7292479442d714fb7bc670965ca4dcbd63932c72c1f4ebaa\""
        id                          = "mageos-commerce-data-export"
        name                        = "mageos-commerce-data-export"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"b7aa92fb1e42a016c2827773785bf584ca5d8ccc3a5b9efa663d590941ee2d23\"" -> "W/\"54e6143573471981ac5674b2e2c41a56d86b5c5ec99b5a353f716fe67801fbee\""
        id                          = "mageos-composer"
        name                        = "mageos-composer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"de77a4609d99589cfb41e1133331cc0a5c0c3fcc16997d2c541621b6dc3aa926\"" -> "W/\"a507f2af0e8208c97d9e8a713bda480a1cee63791fb8aa7815b660c3260c1dc0\""
        id                          = "mageos-composer-dependency-version-audit-plugin"
        name                        = "mageos-composer-dependency-version-audit-plugin"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"3bd21290c6d2c6f6008d7ac1207ee84e7e2e8374094d5cd2649665f1a36d2629\"" -> "W/\"fecbc2829d8fe68e3f87536c0a6ac3fc0e8ce8fa89c9e3aa447110e2645e519c\""
        id                          = "mageos-composer-root-update-plugin"
        name                        = "mageos-composer-root-update-plugin"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-inventory"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"e865a1643213ef2c57953c695fc01315622b88cbc8f15922ee0482087a0fe453\"" -> "W/\"b532ed3fc3d4126e09940b67a50f18328678af010d9e6c13063739ecea125501\""
        id                          = "mageos-inventory"
        name                        = "mageos-inventory"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-inventory-composer-installer"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"a8609c7833f8bb75f2485dc4ea20fd2c4012d500ad1acca94d2cd20854195c76\"" -> "W/\"8bbcf1984c73b446fdb6aacd2e900dfe50cf5d3cee154ba49ed895ef9c2aac47\""
        id                          = "mageos-inventory-composer-installer"
        name                        = "mageos-inventory-composer-installer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-coding-standard"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"f308a2c73f37b13d6bc733e819f139e476204c901194487ef3146c25d015b47b\"" -> "W/\"c3c8f47baba4e74ed36ffc8e7f85f8236f40472ed2b961604940341280fb4f1a\""
        id                          = "mageos-magento-coding-standard"
        name                        = "mageos-magento-coding-standard"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-composer-installer"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"f7439251a91f7c0a5c086242caa26a0d23e8cb7dc248411de042c5681092b4a9\"" -> "W/\"27909c5ae938e927c2852b69fe50a1f6184296d1aab6c3836a1f8b51875d219a\""
        id                          = "mageos-magento-composer-installer"
        name                        = "mageos-magento-composer-installer"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"4d9913a5818f9b51fa13e7d7505b6837ae8ef15629873b1d5c4f0d60347f6550\"" -> "W/\"c562fd55bdc35a11d8cd9fed23d28a55027f142797b73e308fb73a203aa3eb14\""
        id                          = "mageos-magento2"
        name                        = "mageos-magento2"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-functional-testing-framework"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"cf6ff71179562f52c33ac449656ec1b92d6a1331d462991314585d12acae3e93\"" -> "W/\"486991b84368a365fc5277be3dc73172917e1339ac1bde3ebdd2280f62edbe6a\""
        id                          = "mageos-magento2-functional-testing-framework"
        name                        = "mageos-magento2-functional-testing-framework"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-page-builder"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"adee21514a6b64420f07f4de988990db0ca1410afb3bc400bd2e7cd135b1d09b\"" -> "W/\"1128dd5b0eccd47d2f963d64634b0ce3f3f53271e058f1c0c01e2a8c81321857\""
        id                          = "mageos-magento2-page-builder"
        name                        = "mageos-magento2-page-builder"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-sample-data"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"9bcf176c5d24c3ffc8ba43c35b801e5e860301eb28f5f1ef94c8846e0f6927e8\"" -> "W/\"e3461f7cf954fa1ec6fdffad5f0ef5f08059d524b0f9c382a08ce704bcc16b4d\""
        id                          = "mageos-magento2-sample-data"
        name                        = "mageos-magento2-sample-data"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-security-package"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"42eb47a3152b1a07688c68f343eff78adcefef5e6abfc1475ec1c5c011679f52\"" -> "W/\"828038c97253db8febca8cf3ada99d25167370d1d1bcaa3a8baa396d9dfa538c\""
        id                          = "mageos-security-package"
        name                        = "mageos-security-package"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["meta"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"cc40114ea2ffbc05af8310f562e2d3f869c7e215967226a656814ea748cda064\"" -> "W/\"a33da88917c83fe8279a490e456cdf2c02db8beb726721f31cb1442d0092734d\""
        id                          = "meta"
        name                        = "meta"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["namespace"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"a469babc2d523595f250b3f8a29006ddd5da0ad66f8f30e8cc19d69d3b316bb6\"" -> "W/\"6aceb35bdfd8c309df1a1bc48a87326ad9d9b0f157663c9cb4fea95eeb47b9a9\""
        id                          = "namespace"
        name                        = "namespace"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["terraform"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"6d3d426e66c86f3e4e6833c2a7aee58143441257322b1a9d89ec4ae7ac5ed111\"" -> "W/\"635a76854832c82e9a22349c11ea5ff93e1e27b0425a46ea458f2b8e2007fb27\""
        id                          = "terraform"
        name                        = "terraform"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_file.codeowners["mage-os-website"] has changed
  ~ resource "github_repository_file" "codeowners" {
      ~ commit_author       = "mage-os-ci" -> "Mage-OS CI Bot"
      ~ commit_email        = "info@mage-os.org" -> "info+ci@mage-os.org"
        id                  = "mage-os-website/CODEOWNERS"
        # (9 unchanged attributes hidden)
    }

  # github_team.teams["async-events"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"46e88868d0f12e42f4d70f9be4010b0e7df3e68cb137358484b750538fa7b65b\"" -> "W/\"50f524d49dc3f373295fde52c417400e04d4007f11f6faf61ed5f17b0b2ac54f\""
        id                        = "7998296"
      ~ members_count             = 0 -> 1
        name                      = "async-events"
        # (5 unchanged attributes hidden)
    }

  # github_team.teams["content"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"e4f22cbf09e8f86f4594e40dcad263332e58238657b486d1426de639f2bb1daa\"" -> "W/\"c0eb82bb1c78e58af10f91b822cd6623f1d933b09b4b22813c3927152bc0d41a\""
        id                        = "6847102"
        name                      = "content"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["continuous-integration"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"8bc477a9a78c365ec9296aba258cc64e14ad3d0feebc6517a8ef555fa17d7f45\"" -> "W/\"6a6ea637de8365fa77488f17bca26e350095d6dfd287f5d9ff0df7243bb44789\""
        id                        = "6847099"
        name                      = "continuous-integration"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["distribution"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"c6bf621bafff7d90e71a18e90a92173701e2c6f6900197c7a8fdccba57e8024a\"" -> "W/\"381d92dab3381ec82a6b11bcf2611ac26e70763a259725d354e66a97c3af1789\""
        id                        = "6847101"
        name                      = "distribution"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["infrastructure"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"0c8224af054bc3cc6e5b60972c86e6877be42d728363410076acd625d7e9f5da\"" -> "W/\"48d5d25383e2faa790c47aa8d60d741a652292bbe5f01121778dab51e31c3b90\""
        id                        = "6847100"
        name                      = "infrastructure"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["tech-lead"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"8060a4ca8f1d4f369a65744dd9cbad426380664175b37a3c48f506cd702bd12b\"" -> "W/\"3cc6f20ee7dbd4baf543975945307a0541c23d2e31ee24e4f16eb1c89be9b129\""
        id                        = "6847098"
        name                      = "tech-lead"
        # (6 unchanged attributes hidden)
    }

  # github_team_membership.members["DavidLambauer_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"db4b157099eabbdb047800ea156f9e0f4a6e6266c5851f74871c03ea540c9c0e\"" -> "W/\"9b0d6de0745b2908b150df50038a920cc44e268e255f4522d9346cc3bac59ca7\""
        id       = "6847100:DavidLambauer"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"dcf4cf88f6e6e1015e66f68f507cbaace029b3d081f923b9d584f2875dbe9838\"" -> "W/\"44a1db789d48f664a55c42aefe349361dbfde902f69b047071948455292fdf0c\""
        id       = "6847102:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"e6957c32bf0396ef4d774fd28de7c565c1c5525a9344eb1c76316f9f5e0db7a8\"" -> "W/\"a3642795831712b5efdaf606167fc219ce2be87b2e1b460e2d9bc97d659fbf77\""
        id       = "6847101:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"3edc433c05a9f6f222edfc6fbfd7952d9e7aaa71dd6388d9f34158bfbccfd8e3\"" -> "W/\"a7f7e5c376eda549be14e83f8b4f9f678295bd2c7197794e3c9112f6f620e3e0\""
        id       = "6847100:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_tech-lead"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"05db0a5009a1c7ea8d1e08bd13224d3fff238acceae33d69b12f36275276454e\"" -> "W/\"3595077d82f595c7c58f98ce668a6a89657047860be3a465aa5a5fa5a60a4ae4\""
        id       = "6847098:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"c707a6a08753e5ba9b27fc81d254aac33ea432fe50842e32a581db838b17f9fa\"" -> "W/\"5c2b1c808292c5afbd35a3b25a62b7a7c3b030b023054a0fb566deadfa689ee0\""
        id       = "6847101:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"e2111b2737df1243bb5f51a8104a46cd45156d291e06ef201a4d6642696348c6\"" -> "W/\"13f2548c51f917d21b670184b2b84bd93e553723dc2c310c8e1472f2a02c3adc\""
        id       = "6847100:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["gowrizrh_async-events"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"5d0dbd16ae72b6d19ffcd6eec2439f2a4b0fed6dbc1fcd57545c8c945a9879c9\"" -> "W/\"f03901acebe57653d3b1db0c6a5ed4479deb4acf2f7d13d7f7a8cee9a615b8bd\""
        id       = "7998296:gowrizrh"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["johnhughes1984_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"682f28ea8d4985253495d692ac62f08cc5bbc698ef61b26d39a735b406102b2a\"" -> "W/\"188c181e1d409ff298c8bec82837245abc72bfaab22a3680de0159d5f5f7faeb\""
        id       = "6847102:johnhughes1984"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["mage-os-ci_continuous-integration"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"5b9ccbf874e0d201a766f3e79e89b44148da6718c8e01cff41192ff7bd8db84c\"" -> "W/\"5081ec42931716e4a784e9984119c36a53612fbf6b898e90c389a1905720eb1b\""
        id       = "6847099:mage-os-ci"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"26be1818849af175fcba016c7534496d97a27ca018a6f7d605ba9766a3e3e9da\"" -> "W/\"dd3fc84825280cd390180051e86b85294f0fc54174e64ffa1ae73a6392aafb08\""
        id       = "6847101:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"8645ab590fc34197006a34b6b2efc1094d45c3e81bcb65bf028455409ab5c621\"" -> "W/\"5e66b591564c14a61c3263ef45fc661f768e5c0c8150562394626d809d35f64d\""
        id       = "6847100:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["wigman_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"c10ae4946116f25f4da3c88bc1dff6b969863f269c3972781e1aaf385e569e7d\"" -> "W/\"81306e90bb7837476bfb9a15373c3a4d3780986a98131fb3f22e94c0a5d0cd8c\""
        id       = "6847102:wigman"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["dev-env-gitpod_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"52b1a625ccaa3c37fd82748eecf013b37f3d4ee444adaeed1ccb834d842943ad\"" -> "W/\"e3b47e0cd681e38fa87425f28c7c87348837c38ea30e52e3a5c3cc81d44ae8f9\""
        id         = "6847100:dev-env-gitpod"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["generate-mirror-repo-js_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"8b0818eb815412e24d69b604dab667b9a943d4152dadd44c0c1caec2dc4da55a\"" -> "W/\"97cf72d1c2b50df5db8a263addd5e2f2d14efeb973362104e3c522d29e549f63\""
        id         = "6847100:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["github-actions_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"a33537525d5b37ec531bc3d11a4413f14ba1b6034594690d6aff6762a30eb928\"" -> "W/\"915da4e297179bd1898cbf351361b7017b9117a6dd9030d66371aea531fb0092\""
        id         = "6847101:github-actions"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["infrastructure_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1a9046faa1416b54acb1a3c8ada517afb7e76f683195399dbaf30b1ca1d6b5e7\"" -> "W/\"73952da19b4623c66a21f6efa4211fe103a0baedd8e51c304be969761b72cfe9\""
        id         = "6847100:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mage-os-website_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1088db21c9a3fd8f265c00dca806f6edd256310051ae449304e9d4a3e059f1c9\"" -> "W/\"6dd1c8f7fbab3065c3f5fea83083d494b3dadac77afc986e97e4b619a329768f\""
        id         = "6847102:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-adobe-stock-integration_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"415a3899e427d72abbf0609ef223a783b798ecf133f8ecf0cbb6b7f5e8b0f9bc\"" -> "W/\"7f22e39e2b94e699ebf198514cb77622e6f92109d50a82fe70fc8652cc074efe\""
        id         = "6847101:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-async-events_async-events"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6765acd9f42de57cb13a9dd86666dea4658e00e023269817c0c0bdd7b315dd40\"" -> "W/\"3ca35a8f8750d7be11b8cdb47832bb4b06c0a743838f52be21857bdda5ebb5a4\""
        id         = "7998296:mageos-async-events"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-async-events_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6765acd9f42de57cb13a9dd86666dea4658e00e023269817c0c0bdd7b315dd40\"" -> "W/\"3ca35a8f8750d7be11b8cdb47832bb4b06c0a743838f52be21857bdda5ebb5a4\""
        id         = "6847101:mageos-async-events"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-commerce-data-export_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"561eaf3ec2a74214b1ed22fa1bc24243b568e07af6ad8508ea14d67e4aabfc80\"" -> "W/\"2d025683381e416b5883e94d475b55c464fc4938b3047cdcbae3c966403db3fa\""
        id         = "6847101:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"23e181d801a4a8cd5761ba22a2a2c1148a6c80bdb43d1ae2a78631c9c96f7961\"" -> "W/\"7e84abbb440f570893aca79d2f4bd15c50cfeb7486503c6ecca98d09760637bc\""
        id         = "6847101:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-root-update-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"d3b29bf68e0aaf7e493665acc96bc4aa90e9a8cc9c2400cc740f38e453d138b1\"" -> "W/\"4866e095817190012fc3172e1f9c30df8a2ae476f6dafbc69f5f53ea077b5963\""
        id         = "6847101:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1312abcb404a7472fadd146e1bcbc3cafc0f4da9925b5497720df27e4f7cefbd\"" -> "W/\"d4b91d65e05efa31f065c338fa4356111475c93e23220dd6a7d1f7fa083cd1c2\""
        id         = "6847101:mageos-composer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"71b355d6e17ab9ec538975010fdd36dd1061538dd26c409acacb0c08910ffb40\"" -> "W/\"8da7b6dc39203dafe5bef0a52de5d518729163627c8bc17da659a2242c54aa15\""
        id         = "6847101:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"a2a71491553664d97442c061f81e6da6f9b16e3fb6044b06effbb800d49f007c\"" -> "W/\"74ce81da4aeca9d27b96895d993f77d8a5a719238349e34cc8f6dfbbecb96e5b\""
        id         = "6847101:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento-coding-standard_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"3f04d5f33e2bf58accfd0fd7b4e3c33de361d529083f24bb6caee6877d93b1b4\"" -> "W/\"67c4aed5f2608b718d4b1eb5320001f8d88c47256ab6312fbf534d937da80711\""
        id         = "6847101:mageos-magento-coding-standard"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"71460b417e5fb86d111e7fdea81de5acc96bcafc148aaebe27b345debd92d0c7\"" -> "W/\"9c04019421f05926eb002c32b5ccbca02d0083bb01878a063359d6bdb59dfd80\""
        id         = "6847101:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-functional-testing-framework_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"049157a5c81bc898167b013f5a0ab2bcf156b1384c9ffe7d6a931606f6a05b57\"" -> "W/\"974aca129e6e1dca0428249faf6ee8d2eaeb53aec6a06d13bab326013496c0b4\""
        id         = "6847101:mageos-magento2-functional-testing-framework"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-page-builder_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"bd682a1cf7e750541af3389b1696c48137877ef78618ff7efe2fd82586334983\"" -> "W/\"75cd5df106b8ef7c0ee281e97ec317352928b824be491bc97320b96bf5e6e6b1\""
        id         = "6847101:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-sample-data_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"530a2231cfa11802dde0bfb145eebbe987db11695400fbb7a3375ce655fd469b\"" -> "W/\"e98543a65fea37679881d42595cd1445f9637ab6a379ddf0890a046fb14b51ad\""
        id         = "6847101:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e222baacb7a9d76be2c13c0d25e57a49fdd83666d97fd06dd0f661480700fac8\"" -> "W/\"8ad765afcfd06aef5a3daf5016b0d43f48c5bcc148e4df9f19d9977551d9a8ee\""
        id         = "6847101:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-security-package_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"23376f93c596e3c45611e177c55a88a115ed89755aa443ebc7b824775022d56f\"" -> "W/\"e6a71995a93d32573f29c46607f2afd755a04947f2f4cde66f9804a9a03fe601\""
        id         = "6847101:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["meta_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"519041c39a77ed5cf0dc00bf3ab3750f78dd8928de008f4e9796a7a2abcaa904\"" -> "W/\"77c8c20c2315e1f08aa838b50759279253edad3fd614b25ef841680da3586092\""
        id         = "6847102:meta"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["meta_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"519041c39a77ed5cf0dc00bf3ab3750f78dd8928de008f4e9796a7a2abcaa904\"" -> "W/\"77c8c20c2315e1f08aa838b50759279253edad3fd614b25ef841680da3586092\""
        id         = "6847101:meta"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["meta_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"519041c39a77ed5cf0dc00bf3ab3750f78dd8928de008f4e9796a7a2abcaa904\"" -> "W/\"77c8c20c2315e1f08aa838b50759279253edad3fd614b25ef841680da3586092\""
        id         = "6847100:meta"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["meta_tech-lead"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"519041c39a77ed5cf0dc00bf3ab3750f78dd8928de008f4e9796a7a2abcaa904\"" -> "W/\"5385f2f8e9c7be0355687ab78be2c5c1eccbc6d284f42fca7a7c656509f985f6\""
        id         = "6847098:meta"
      ~ permission = "push" -> "maintain"
        # (2 unchanged attributes hidden)
    }

  # github_team_repository.teams["namespace_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"13b16dff64192d7ef4c66419da1033634b8ffead490c44afe21e5ecd74e12a3b\"" -> "W/\"d1bd4d02b450449ec0dbb826f42df9e2ab2af3eb0cad1d586410ff4285aa1497\""
        id         = "6847100:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["terraform_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"1f6022c0a1f35cd254114c91170da4792b1ede2b00645efc2a527c965766bb69\"" -> "W/\"4c747a07caf8cc1e121d0435ad19b1e6e0de897cb17305aaf50a3d1fae6f038b\""
        id         = "6847100:terraform"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["dev-env-gitpod"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"ed02f6fdbd1fc9eccf3cf32c22ee6ba169be89e510c7d7aa5eb3000d31344166\"" -> "W/\"60a308a067019f689e1f0c39bb9466952726b0b8a21b5d010ab0ab2e1b7dd852\""
        id         = "6847098:dev-env-gitpod"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["generate-mirror-repo-js"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"e7a3266568512bde045fa50e2652f4d9f39c71a7ccdf05e507eae99969c9f1e6\"" -> "W/\"6fcaeb23578ae415e6f8b15fc58f4ed1d167bc7c2991f2a881801e1bd8076c4f\""
        id         = "6847098:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["github-actions"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"c966ca48f751fd057cde095d8061e4c18d8478dc78e5cb7fd483aad4be609c35\"" -> "W/\"9a6572ae202b542f1a309e29e9cc23261b723eaeda14d047488493afd9ebe2ad\""
        id         = "6847098:github-actions"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["infrastructure"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"5bc37ddb2e82358d6762c188a2bbadf87b11314417a241fed640184a38037da2\"" -> "W/\"cd1d4c3d7db3095c44798644985763ec6cf2e015a673317b60501760567a0548\""
        id         = "6847098:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mage-os-website"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"b9e5a3223f2cb47c376541456d1e71f35c6340bc5d1dd40a7d705b875b94b6a6\"" -> "W/\"74b63313c9c97d7375f88dd2345d6a8a38ee608630f53cf31d276c000031bcac\""
        id         = "6847098:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-adobe-stock-integration"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"e340ff3eb7cb2f413431db80fc53f5f38253b5abd3dbfe2814379f2b1f552347\"" -> "W/\"9df340185a588498a0aafdb9e6881fd09822491ca048e138de8c76c1bc6b5bae\""
        id         = "6847098:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-async-events"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"64d2c36d25f9e16d52f409b4639f84be2cedac5d48a5cf638aa76b14c7cc90d9\"" -> "W/\"d9d1d0f2fc42220a61b73c19d8e249abd8f9af0de8475d66d4232e907734b5a8\""
        id         = "6847098:mageos-async-events"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-commerce-data-export"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"fa7ee50da7c3a310eeca03a10717940c0c7b1cc82ce364a2d0fd975d89fd2593\"" -> "W/\"3b8d59da53dd9d3413ac596ae91b0f4e4e09df66cba542ff69702a5fbbdb9071\""
        id         = "6847098:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"1d72edff2a9a54599fc8a0878ab040f4bc17b3af9dcbb1eb1faa74bf2e1c9779\"" -> "W/\"8817b25bed3d92fa1badb24d1bb2e6d2adc38b7d60ccf18e4579cc9780a8c873\""
        id         = "6847098:mageos-composer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"870bfe780942ec56eb0a1ad902172f108fbbd66609ea52b4d338ecc8113945b2\"" -> "W/\"422cf9a51dbef9807aa74723829d0adb387fae112f75d1a2cfd557969bcfefa3\""
        id         = "6847098:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"ceaca0debe7ed3b30fba3f35cc662cadd546d3d715c9358a4748047688c68007\"" -> "W/\"d1699eb28db6d844a5372b79c884f171be114936d00f3c2996cac9d9244a7ee8\""
        id         = "6847098:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"42f01557e8027b5c7212d586f8d01c5468848d84d6611e2ef5aa9f3bfd9bb507\"" -> "W/\"859f30ab16e239da5323729391dc710e77d6da96cfa50e1f217a42ef22283b64\""
        id         = "6847098:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"5b0e441717b87d6dcb83f6fbff7b4328f9d827131d24675508bdfa0e7e14b15e\"" -> "W/\"5e5b61fcb9cb42d62061af599439f779aba87840693ece7834fc0729aa85c366\""
        id         = "6847098:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento-coding-standard"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"1174fbf8003133807b7fa0e9c64d7dfbcf4b4beda6fa13413a9d77ebfe17c74a\"" -> "W/\"ccbc91a5cc8af3a342ab66e1c68e11d68eb07c962d49373f8d24a2768b0ccf58\""
        id         = "6847098:mageos-magento-coding-standard"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"a74e0b43728eff5ac61b3ce05a3a5488d346d50e3334b7514a2e0337fc685ff1\"" -> "W/\"02857cbb4f5c9c6c80466f3e4453ab88a0ac567b521231ec3c8880db6e606c24\""
        id         = "6847098:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"3de4b973ca8c8af35c1c79b2c192e636ef0de4b1b926bbb5bf5747b4ba71fd42\"" -> "W/\"12078a6809ffdac30dcaf78fae69730fa7670d2e411570f8c7e38888f909516f\""
        id         = "6847098:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-functional-testing-framework"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"488b8fcc7512f4fb15ae41c2957b070f83682b56d2d59e18b92938cf134e3896\"" -> "W/\"01de143e7d5f268bb4cdecc40867e98c97fe08fd0732cb422ef9b9cd7f04019f\""
        id         = "6847098:mageos-magento2-functional-testing-framework"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-page-builder"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"0cfda267f9b068e9ba33cbffab7701ecb19b9817fd722b3c7e3628ce9b6ad44a\"" -> "W/\"6eddf60bda32174c52980fa9b894346fb3d54e42009c6fc5a856d4b851eefcb7\""
        id         = "6847098:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-sample-data"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"f5c6103ac6370481e32f40929b244e9a6ad79b598c0f574e2c95dc1b7285e74f\"" -> "W/\"30af180721ef8b0a4a5f3c054937a6203746ad4f8e5b163f14dd103435135d88\""
        id         = "6847098:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-security-package"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"5cb095412d722b309d7ed9efc707fd7dac0a1f2c318b7c3199b94dccb55aea4d\"" -> "W/\"317103f0c3ee87b4a0fb443bd33b578ab22eaa6b9f56bee6f3413434f8e11cd2\""
        id         = "6847098:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["meta"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"a5fba73cd23e0c8d0b81859cdb2b9100e9952dcb3e1bc65351f5e88c44811e33\"" -> "W/\"5385f2f8e9c7be0355687ab78be2c5c1eccbc6d284f42fca7a7c656509f985f6\""
        id         = "6847098:meta"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["namespace"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"acc6dc9a391fd5c6abfa99cf67ee826855608c82e453d07f6b91bdaffed85314\"" -> "W/\"9f6255d9fa9fcfdc189a2df3bd077b08dc38fa8139b0ebf6d6cc266192dddd89\""
        id         = "6847098:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["terraform"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"b93b5757623a7599730122965b1794d14fdecab19a0b387ce83457bb4a8f7456\"" -> "W/\"c238024120d3537cde67558e89b13fd42d8955e937c474faf6338b11f651b45c\""
        id         = "6847098:terraform"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.repositories["devdocs"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.repositories["devdocs"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Mage-OS devdocs"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "devdocs"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "adobecommerce",
          + "documentation",
          + "ecommerce",
          + "mage-os",
          + "magento2",
        ]
      + visibility                  = (known after apply)

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # github_repository_file.codeowners["devdocs"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = (known after apply)
      + commit_author       = "mage-os-ci"
      + commit_email        = "info@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/infrastructure @Mage-OS/content"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "devdocs"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["mage-os-website"] will be updated in-place
  ~ resource "github_repository_file" "codeowners" {
      ~ commit_author       = "Mage-OS CI Bot" -> "mage-os-ci"
      ~ commit_email        = "info+ci@mage-os.org" -> "info@mage-os.org"
        id                  = "mage-os-website/CODEOWNERS"
        # (9 unchanged attributes hidden)
    }

  # github_team_membership.members["DavidLambauer_content"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6847102"
      + username = "DavidLambauer"
    }

  # github_team_repository.teams["devdocs_content"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "devdocs"
      + team_id    = "content"
    }

  # github_team_repository.teams["devdocs_infrastructure"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "devdocs"
      + team_id    = "infrastructure"
    }

  # github_team_repository.teams["meta_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "meta"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["meta_tech-lead"] will be updated in-place
  ~ resource "github_team_repository" "teams" {
        id         = "6847098:meta"
      ~ permission = "maintain" -> "push"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["devdocs"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "devdocs"
      + team_id    = "6847098"
    }

Plan: 8 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/5342538822